#+PROPERTY: header-args:jupyter-python+ :async t
#+PROPERTY: header-args:jupyter-python+ :session /global/u2/m/mkramer/.local/share/jupyter/runtime/kernel-39333.json

* Muon dt distribution
#+begin_src jupyter-python
muons = df.query('strength == strength')  # hack: removes NaN
diffs = muons[['trigSec', 'trigNanoSec']].diff().dropna()
diffs_us = diffs.trigSec * 1e6 + diffs.trigNanoSec * 1e-3
#+end_src

#+RESULTS:
: # Out[75]:
